const exercises = {
	shoulders: 
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Підйоми з гантелями</h2>
	    <ul>
	    	<li>Стати прямо з гантелями в руках, зігнути лікті і підняти гантелі до рівня плечей.</li>
	    	<li>Потім повільно підняти гантелі вгору, випрямляючи руки, і повільно опустити їх назад до плечей.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Вправа "молотки"</h2>
	    <ul>
	    	<li>Стати прямо з гантелями в руках, підняти їх до рівня плечей, згинаючи лікті. </li>
	    	<li>Потім по черзі піднімати гантелі вгору, випрямляючи руки, і опускати їх повільно назад до плечей.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Підйоми гантелей на бічні м'язи плеча</h2>
		<ul>
	    	<li>Стати прямо з гантелями в руках, зігнути лікті і підняти гантелі до рівня плечей. </li>
	    	<li>Потім повільно підняти гантелі в сторони до рівня плечей, зберігаючи руки зігнутими в ліктях, і повільно опустити їх назад до плечей.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>4) Вправа "змійка"</h2>
		<ul>
	    	<li>Стати прямо з гантелями в руках, підняти їх до рівня плечей, згинаючи лікті. </li>
	    	<li>Потім повільно підняти гантелі вгору, розсунувши руки в сторони, і повернути їх назад до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
	   	<div class="item">
	    <h2>5)	Підйоми гантелей в плані плечей</h2>
		<ul>
	    	<li>Стати прямо з гантелями в руках, підняти їх до рівня плечей, згинаючи лікті.</li>
	    	<li>Потім повільно підняти гантелі вперед до рівня плечей, зберігаючи руки зігнутими в ліктях, і повільно опустити їх назад до плечей.</li>
	    	<li>Повторити вправу, піднімаючи гантелі в сторони до рівня плечей, зберігаючи руки зіггнутими</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		</div>`,
	chest: 
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Жим гантелей лежачи на лавці</h2>
	    <ul>
	    	<li>Ляжте на лавку і тримайте гантелі на рівні грудей, лікті повинні бути зігнуті під кутом 90 градусів.</li>
	    	<li>Розгойдайте гантелі вгору до повної прямуватості рук, потім повільно опустіть їх до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    	
	    </div>
	    <div class="item">
	    <h2>2) Віджимання від підлоги</h2>
	    <ul>
	    	<li>Поставте долоні на підлогу ширше плечей, спину тримайте прямо.</li>
	    	<li>На вдиху згинаючи лікті, опустіть груди до підлоги, згинайте лікті під кутом 90 градусів.</li>
	    	<li>На видиху поверніться до початкового положення, розправляючи руки до повної прямуватості.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Жим штанги лежачи на лавці</h2>
		<ul>
	    	<li>Лягте на лавку зі штангою на рівні грудей.</li>
	    	<li>Захопіть штангу руками на ширині плечей і віджміть її вгору до повної прямуватості рук.</li>
	    	<li>Повільно опустіть штангу до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>4) Віджимання від бруса</h2>
		<ul>
	    	<li>Сідайте на брус, розташованого високо на рівні грудей.</li>
	    	<li>Захопіть брус руками на ширині плечей і віджимайтесь вгору до повної прямуватості рук.</li>
	    	<li>На видиху поверніться до початкового положення, згинаючи лікті під кутом 90 градусів.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		</div>`,
	press: 
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Класичні підйоми ніг</h2>
	    <ul>
	    	<li>Лежачи на спині на скам'янці для пресу, підніміть ноги прямо вгору, тримаючи їх зігнутими в колінах. </li>
	    	<li>Потім повільно опустіть ноги назад, але не до кінця, а знову підніміть їх.</li>
	    	<li>Повторіть 3-4 підходи по 10-12 разів.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Повороти з м'ячем</h2>
	    <ul>
	    	<li>Лежачи на спині з ногами зігнутими в колінах, візьміть м'яч і поверніться на бік, опускаючи м'яч на бік.</li>
	    	<li>Потім поверніться назад, відбиваючи м'яч назад.</li>
	    	<li>Повторіть 3-4 підходи по 10-12 разів для кожного боку.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Вправа "скручування"</h2>
		<ul>
	    	<li>Ляжте на спину на мату або на скам'янку для пресу, зігнувши коліна та опустивши ноги на підлогу. Позиціонуйте свої ноги на ширині плечей та підперіть ступні на підлозі.</li>
	    	<li>Покладіть руки за голову або складіть їх на грудях. Це допоможе уникнути шийного напруження під час виконання вправи.</li>
	    	<li>Зігніть лікті та підніміть голову, шию та верхню частину спини з мату або скам'янки для пресу. Лопатки повинні відірватися від поверхні.</li>
	    	<li>Сконцентруйтеся на стискуванні м'язів пресу, піднімаючи плечі з мату або скам'янки для пресу.</li>
	    	<li>Поверніться до початкового положення, повільно опускаючи верхню частину спини на мат або на скам'янку для пресу.</li>
	    	<li>Повторіть цю вправу 10-15 разів на 2-3 підходи, залежно від вашої фізичної підготовки.</li>
	    </ul>
	    </div>
		</div>`,
	triceps: 
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Жими лежачи з гантелями або штангою</h2>
	    <ul>
	    	<li>Ця вправа є однією з найефективніших для зміцнення тріцепсу. Лягаючи на лаву для жимів, тримайте штангу або гантелі над грудьми та піднімайте їх назад, прямуючи руки повністю.</li>
	    	<li>Потім повільно опустіть важіль або гантелі до грудей. </li>
	    	<li>Повторіть цю вправу на 3-4 підходи по 8-12 разів.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Пуловер з гантелем</h2>
	    <ul>
	    	<li>Лягаючи на лаву, тримайте гантель двома руками за кінці. </li>
	    	<li>Повільно опустіть гантель за голову, зберігаючи руки прямими.</li>
	    	<li>Потім повільно підніміть гантель назад до початкового положення. </li>
	    	<li>Виконуйте цю вправу на 3-4 підходи по 10-12 разів.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Жими стоячи на блоках кроссовер</h2>
		<ul>
	    	<li>Стійте перед тренажером кроссовер, встановленого на середній висоті, з ручками, прикріпленими до блоків. Візьміть ручки в руки та стійте прямо з легко зігнутими ліктями.</li>
	    	<li>Потім випряміть руки перед собою, тягнучи ручки вниз та на зустріч одна одній.</li>
	    	<li>Зупиніться на секунду, потім повільно поверніться до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		</div>`,
	brachioralis:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Згинання зап'ястя з гантелем</h2>
	    <ul>
	    	<li>Візьміть гантелі в руки і присядьте, злегка нахиляючись вперед.</li>
	    	<li>Зігніть зап'ястя так, щоб гантелі піднімалися вгору, а потім повільно поверніть їх до початкового положення.</li>
	    	<li>Повторіть цю вправу на 3-4 підходи по 8-12 разів.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Відведення зап'ястя з гантелем</h2>
	    <ul>
	    	<li>Візьміть гантелі в руки і присядьте, злегка нахиляючись вперед. </li>
	    	<li>Відведіть зап'ястя від тіла і потім поверніть їх до початкового положення.</li>
	    	<li>Виконуйте цю вправу на 3-4 підходи по 10-12 разів.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Планка на зап'ястях</h2>
		<ul>
	    	<li>Візьміть позу планки, опираючись на зап'ястя, а не на лікті. </li>
	    	<li>Потім почніть згинати зап'ястя, піднімаючи вгору тіло, а потім повільно поверніть його до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		<div class="item">
	    <h2>4) Стійка зі згинанням зап'ястя</h2>
		<ul>
	    	<li>Станьте прямо, ноги на ширині плечей. </li>
	    	<li>Візьміть гантелі в руки і підніміть їх до рівня плечей.</li>
	    	<li>Зігніть зап'ястя, піднімаючи гантелі вгору, а потім повільно поверніть їх до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>5) Згинання зап'ястя зі станової тяги</h2>
		<ul>
	    	<li>Візьміть штангу зі станової тяги в руки, стоячи на ширині плечей. </li>
	    	<li>Зігніть зап'ястя, піднімаючи штангу вгору, а потім повільно поверніть її до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		</div>`,
	biceps:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Згинання рук з гантелями</h2>
	    <ul>
	    	<li>Візьміть гантелі в руки, стоячи зі спиною прямо.</li>
	    	<li>Зігніть руки в ліктьовому суглобі, піднімаючи гантелі до плеча, а потім повільно поверніть їх до початкового положення.</li>
	    	<li>Повторіть цю вправу на 3-4 підходи по 8-12 разів.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Штанга зі станової тяги</h2>
	    <ul>
	    	<li>Станьте перед штангою зі станової тяги, ноги на ширині плечей.</li>
	    	<li>Візьміть штангу в руки, зігніть руки в ліктьовому суглобі, піднімаючи її до плеча, а потім повільно поверніть її до початкового положення.</li>
	    	<li>Виконуйте цю вправу на 3-4 підходи по 10-12 разів.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Концентровані згинання рук</h2>
		<ul>
	    	<li>Сідайте на стілець з гантелями в руках. </li>
	    	<li>Зігніть руки в ліктьовому суглобі, піднімаючи гантелі до плеча, а потім повільно поверніть їх до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		<div class="item">
	    <h2>4) Згинання рук на біцепс-машині</h2>
		<ul>
	    	<li>Сідайте на біцепс-машину і ставте стопи на платформу.</li>
	    	<li>Зігніть руки в ліктьовому суглобі, піднімаючи важіль до плеча, а потім повільно поверніть його до початкового положення.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		</div>`,
	lowervastus:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Підйом на носочки</h2>
	    <ul>
	    	<li>Стійте на рівній поверхні з ногами на ширині плечей і підніміться на носочки. Утримуйтеся в такому положенні на 1-2 секунди, а потім повільно опускайтеся.</li>
	    	<li>Повторіть цю вправу на 3-4 підходи по 8-12 разів.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Присідання на носочках</h2>
	    <ul>
	    	<li>Стійте біля стіни або будь-якого опору і підніміться на носочки.</li>
	    	<li>Затримайтеся в цьому положенні, потім почніть присідати, опускаючи тіло вниз.</li>
	    	<li>Поверніться до початкового положення на носочках. Повторіть вправу 10-15 разів.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Вправа на гомілки з гантелями</h2>
		<ul>
	    	<li>Сідайте на стілець з гантелями в руках і підніміть ноги згори донизу.</li>
	    	<li>Напніть гомілки, тримайте в цьому положенні на 2-3 секунди, а потім повільно опустіть ноги.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		<div class="item">
	    <h2>4) Ходьба на носочках</h2>
		<ul>
	    	<li>Ходіть на носочках, тримаючи спину прямо.</li>
	    	<li>По можливості пройдіть відстань не менше 30 метрів.</li>
	    	<li>Повторіть вправу 3 рази</li>
	    </ul>
	    </div>
		</div>`,
	vastus:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Присідання</h2>
	    <ul>
	    	<li>Станьте з ногами на ширині плечей, опустіть таз до рівня колін, якщо це можливо, і повільно поверніться в стійку.</li>
	    	<li>Повторіть цю вправу на 3-4 підходи по 8-12 разів.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Висування ніг на тренажері</h2>
	    <ul>
	    	<li>Сідайте на тренажер з важелями на боках і підніміть ноги вгору, напівсидячи. Затримайтеся в цьому положенні на 2-3 секунди, потім повільно поверніться до початкового положення.</li>
	    	<li>Виконуйте цю вправу на 3-4 підходи по 10-12 разів.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Ходьба вгору по сходах</h2>
		<ul>
	    	<li>Ходіть вгору по сходах, піднімаючи кожну ногу відповідно до кожного кроку.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		<div class="item">
	    <h2>4) Вправа на велотренажері</h2>
		<ul>
	    	<li>Сідайте на велотренажер і рухайтеся, натискуючи педалі вниз.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
	   	<div class="item">
	    <h2>5) Переднє присідання з гантелями</h2>
		<ul>
	    	<li>Стійте з ногами на ширині плечей з гантелями в руках, піднятими на рівень плечей.</li>
	    	<li>Зробіть присідання, опустивши таз до рівня колін.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		</div>`,
	upback:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Широкі підтягування на перекладині</h2>
	    <ul>
	    	<li>Схопіть перекладину з широким хватом, розташуйте руки на відстані більше, ніж ширина плечей, та підніміть своє тіло до перекладини.</li>
	    	<li>Повільно опустіться назад та повторіть.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Тяга верхньої блокової машини</h2>
	    <ul>
	    	<li>Сідайте перед блоковою машиною, схопіть ручки згори та тягніть їх до грудей.</li>
	    	<li>Повільно поверніться в початкове положення та повторіть.</li>
	    </ul>
	    </div>
	    <div class="item">
	    <h2>3) Гантельні рядки</h2>
		<ul>
	    	<li>Схопіть гантелі та нахиліться вперед, зігнувши коліна та спиняючись.</li>
	    	<li>Підніміть гантелі до бічних м'язів та повільно опустіть їх назад.</li>
	    	<li>Повторіть вправу 8-12 разів на 2-3 підходи.</li>
	    </ul>
	    </div>
		</div>`,
	lowback:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Підйом ніг на брусах</h2>
	    <ul>
	    	<li>Підійміться на бруси та повісьте на руках, з ногами, що звисають вниз.</li>
	    	<li>Повільно підніміть ноги, згинаючи нижню частину спини. Повільно опустіть ноги назад та повторіть вправу.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Тяга штанги до пояса</h2>
	    <ul>
	    	<li>Стійте перед штангою, тримаючи її на відстані, що трохи ширша, ніж ширина плечей.</li>
	    	<li>Нахиліться вперед, зігнувши коліна та спиняючись, та підніміть штангу до пояса, зосереджуючись на скороченні нижньої частини спини.</li>
	    	<li>Повільно опустіть штангу назад та повторіть вправу.</li>
	    </ul>
	    </div>
		</div>`,
	buttocks:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Присідання з гирею</h2>
	    <ul>
	    	<li>Поставте гирю на плечі та зробіть присідання, зосереджуючись на скороченні сідниць.</li>
	    	<li>Повільно поверніться в початкове положення та повторіть вправу.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Зведення ніг на тренажері</h2>
	    <ul>
	    	<li>Сідайте на тренажер для зведення ніг та зведіть ноги разом, зосереджуючись на скороченні сідниць.</li>
	    	<li>Повільно поверніться в початкове положення та повторіть вправу.</li>
	    </ul>
	    </div>
	   	<div class="item">
	    <h2>3) Планка на ліктях з піднятими ногами</h2>
	    <ul>
	    	<li>Візьміть позицію планки на ліктях, а потім підніміть одну ногу, зосереджуючись на скороченні сідниць.</li>
	    	<li>Повільно опустіть ногу назад та повторіть вправу з іншою ногою.</li>
	    </ul>
	    </div>
		</div>`,
	vastusback:
		`<div class="owl-carousel owl-theme">
	    <div class="item">
	    <h2>1) Присідання зі штангою</h2>
	    <ul>
	    	<li>Станьте з штангою на плечах, ноги на ширині плечей.</li>
	    	<li>Зробіть присідання, опустивши таз назад і згинайчи коліна.</li>
	    	<li>Не дозволяйте колінам виступати за пальці ніг. Поверніться в початкове положення.</li>
	    </ul>	
	    </div>
	    <div class="item">
	    <h2>2) Румунський стан</h2>
	    <ul>
	    	<li>Візьміть штангу від підлоги з руками, що трохи ширше за плечі.</li>
	    	<li>Почніть опускати торс вперед, витягуючи штангу вздовж стегна, поки він не опиниться на рівні колін.</li>
	    	<li>Поверніться в початкове положення.</li>
	    </ul>
	    </div>
	   	<div class="item">
	    <h2>3) Зведення ніг на тренажер</h2>
	    <ul>
	    	<li>Сідайте на тренажер для зведення ніг, дозволяючи гомілкам опиратися на подушку.</li>
	    	<li>Поверніть ноги вверх і зітріть кінцівки, зосереджуючись на скороченні біцепсу бедра.</li>
	    	<li>Повільно поверніться в початкове положення.</li>
	    </ul>
	    </div>
		</div>`,
};

const info = document.querySelector("#text-info");


document.querySelectorAll("#BODY path").forEach((el) => { 
	el.addEventListener("click", (e) => {
		document.querySelectorAll("#BODY g").forEach((el) => el.classList.remove("selected"));
		const group = e.target.parentElement;
		group.classList.add("selected");
		const id = group.id;
		info.innerHTML = exercises[id];
		$('.owl-carousel').owlCarousel({
		    loop:true,
		    margin:10,
		    nav:false,
		    dots: true,
		    responsive:{
		        0:{
		            items:1
		        }
			}
		});
	})
})